#include"Feed.h"
// _/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
// 概要:エサクラスのソースファイル
// 
// 制作日:2016/11/11
//
// 制作者:河本恭宏
// _/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/


//============================
// =>概要:エサコンストラクタ
// 
// =>引数:なし
//============================
Feed::Feed()
	:m_pos_x(0), m_pos_y(0), m_grp_w(0), m_grp_h(0)
{

}	 

//============================
// =>概要:エサデストラクタ
//============================
Feed::~Feed()
{

}

//============================
// =>概要:エサアップデート
// 
// =>引数:プレイシーンへのポインタ（Play*）
// 
// =>返り値:なし
//============================
void Feed::Update(Play* playObj)
{

	if (WaitTime())
	{
		SetPosition();
		Generater(playObj);
	}
}
//============================
// =>概要:エサ生成
// 
// =>引数:プレイシーンへのポインタ（Play*）
// 
// =>返り値:なし
//============================
void Feed::Generater(Play* playObj)
{
	m_feed_sprite = cocos2d::Sprite::create("heart_tex01.png");
	m_feed_sprite->setScale(0.1f);
	m_feed_sprite->setPosition(cocos2d::Vec2(m_pos_x, m_pos_y));

	playObj->addChild(m_feed_sprite);
}

//============================
// =>概要:生成までのウェイト
// 
// =>引数:なし
// 
// =>返り値:時間まで来たか
//============================
bool Feed::WaitTime()
{

	static int cnt = 0;
	cnt++;
	if (cnt > 150)
	{
		cnt = 0;
		return true;

	}
	return false;
}

//============================
// =>概要:生成座標の決定
// 
// =>引数:なし
// 
// =>返り値:なし
//============================
void Feed::SetPosition()
{
	m_pos_x = rand() % 25 *32;
	m_pos_y = rand() % 20 *32;
}
